#  Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.
# Пример:
# - 6782 -> 23
# 0,56 -> 11


n = int(input('Введите какоенить число: '))

print(sum(map(int,str(n))))


