# Задача №31: Задайте натуральное число N. 
# Напишите программу, которая составит список простых множителей числа N.

num = int(input("Введите число: "))
i = 1
list = []
primit = num
while i <= num:
    if num % i == 0:
        list.append(i)
        num //= i
        i = 2
    else:
        i += 1
print(f"Простенькие множители числа {primit} приведены в списке: {list}")