# Задача №32: Задайте последовательность чисел. 
# Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

lst = list(map(int, input("Создайте список :\n").split()))
print(f"Исходный список: {lst}")
new_list = []
[new_list.append(i) for i in lst if i not in new_list]
print(f"Список не дублирующихся элементов: {new_list}")