# 2. Напишите программу, которая принимает на вход координаты точки (X и Y), 
# и выдаёт номер четверти плоскости, в которой находится эта точка 
# (или на какой оси она находится).

x = int(input("Введи координатку Х: "))
y = int(input("Введи координатищу Y: "))
if x > 0 and y > 0:
    print("Первая четвярть")
if x < 0 and y > 0:
    print("Вторячок четвериачок")
if x < 0 and y < 0:
    print("Третья, норм")
if x > 0 and y < 0:
    print("Четвертенькая, за всех")