# Напишите программу, которая по заданному номеру четверти, 
# показывает диапазон возможных координат точек в этой четверти (x и y).

n = int(input("Определись с номером четверти:  "))
if n < 1 or n > 4:
    print("Подумай, сколько номеров у четвертей и введи еще раз!")
elif n == 1:
    print("Должен быть x > 0 и y > 0")
elif n == 2:
    print("Будет точно x < 0 и y > 0")
elif n == 3:
    print("Координаты в этом диапазоне x < 0 и y < 0")
elif n == 4:
    print("Реально только так x > 0 и y < 0")